{
  "name": "Attic",
  "longDes": "You are standing in the attic. It is warm up here, and surprisingly bright. There are windows to the North, East, South, and West, overlooking the mansion grounds and woods beyond. A flash of light catches your eye to the North. You see some toys scattered about the floor. The room is not as big as you would have thought. Instead of being perfectly square, a corner of the attic to the southwest seems to be walled off. The only exit is back down the stairs to the pink room on the second floor.",
  "shortDes": "You are in the attic of the mansion. Dust hangs lightly in the warm air. Toys are scattered about, and there are windows to the north, east, south, and west. A steep staircase leads back down to the pink room below.",
  "visited": false,
  "startingItems": [],
  "droppedItems": [],
  "features": 
  [
    {
      "name": "windowsill",
      "actionable": true,
      "preActionDes": "You see a small stone in the window sill.",
      "inActionDes": "You find a smooth crystal. It feels right in your hands.",
      "postActionDes": "This is where you discovered the smooth crystal.",
      "state": 0,
      "featureId": 0

    },

    {
      "name": "hidden door",
      "actionable": true,
      "preActionDes": "You see the outline of a door in the southeast corner of the room.",
      "inActionDes": "You tug and pull as hard as you can. The door must be locked.",
      "postActionDes": "This is still locked.",
      "state": 0,
      "featureId": 1
    },

    {
      "name": "east window",
      "actionable": false,
      "preActionDes": "You look out the window. All you see is the beginning of a large forest.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 2

    },

    {
      "name": "west window",
      "actionable": false,
      "preActionDes": "You look out the window. You can see the garden out this window.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 3
    },

    {
      "name": "south window",
      "actionable": false,
      "preActionDes": "You look out the window. You can see the front porch from here.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 4
    },

    {
      "name": "stairs",
      "actionable": false,
      "preActionDes": "There is a small set of stairs going down. They lead to the second floor landing.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 5
    },

    {
      "name": "toys",
      "actionable": false,
      "preActionDes": "There are many toys here. You see dolls, horses, and a pad of paper with some colored pencils. They are dusty with disuse.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 6
    }
  ],
  "roomId": 13,
  "directions": {"down": 10}
}