{
  "name": "Cellar",
  "longDes": "You find yourself in the cellar of the mansion. The air is cool and dry down here. Light filters in through a small window to the West, and to the East, and motes of dust hang in the air. There is a workbench along the West wall, under one of the windows. You see tools scattered upon it. To the East are some shelves, appearing to be filled with jars, cans, and boxes. There is a door to the South leading to what appear to be servant’s quarters. A staircase leads up to the kitchen. ",
  "shortDes": "You are in the cellar of the mansion. There is a workbench along the west wall, and goods on shelves to the east. There is a window to the east, and another to the west. A door leads South to the servant’s quarters. A staircase leads up to the house kitchen.",
  "visited": false,
  "startingItems": [
    {
      "name":"prybar",
      "description":  "A rusty black prybar.",
      "linkedFeature": 0
    },
    {
      "name":"ashes",
      "description":  "Ashes with white bits in them.",
      "linkedFeature": 2
    }
  ],
  "droppedItems": [],
  "features": [
    {
      "name": "workbench",
      "actionable": true,
      "preActionDes": "The workbench is dusty and cluttered. Amongst the rusty tools, you see a pry bar.",
      "inActionDes": "You pick up the prybar.",
      "postActionDes": "You have already taken the prybar from this bench. You don’t find anything else remarkable.",
      "state": 0,
      "featureId": 0
    },
    {

      "name": "shelves",
      "actionable": false,
      "preActionDes": "You look at the shelves. They are half-stocked with (presumably) spoiled preserves. You cannot tell what any of them are.”,",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 1
    },
    {
      "name": "box",
      "actionable": true,
      "preActionDes": "You see a small wooden box amongst the shelves of goods. Someone took great care in the craftsmanship of this box.",
      "inActionDes": "You open the box and find… Ashes. Amongst the ashes are some small white bits.",
      "postActionDes": "This box has ashes in it.",
      "state": 0,
      "featureId": 2
    }
  ],
  "roomId": 14,
  "directions": {"up": 7, "south": 15}
}
