{
  "name": "Foyer",
  "longDes": "You enter the main foyer. You are instantly awestruck and saddened by the beauty that this old mansion used to have. The marble floors are cracked and haven’t been cared for in years. There is an old, rusty suit of ^armor# along the Western wall that is full of cobwebs and in desperate need of restoration.  The armor’s hand is out-stretched and should be holding something, but it’s missing. There is also an old grandfather ^clock# on the Eastern wall that, surprisingly, is still working. There is a small door to the $North#. There are two larger doors to the $East# and $West# that lead to larger adjoining rooms. To the $South# is the front door to the house.  Lastly, there is a grand spiral staircase towards the Northern wall. This leads $up# to the second floor.",
  "shortDes": "You are standing in the main foyer of the mansion. You see a suit of ^armor# along the west wall. There is a grandfather ^clock# ticking away along the east wall. A large staircase spirals $up# to the second floor. A doorway to the $East# leads to the parlor. To the $South# are the main front doors for the mansion. To the $West# is a doorway to the library.  A small doorway to the $North# leads off to the first floor bathroom.",
  "visited": false,
  "startingItems":[],
  "droppedItems": [],
  "features":
  [
    {
      "name": "armor",
      "actionable": false,
      "usable": true,
      "preActionDes": "This suit of armor very rusted. It's holding a sword in one hand and the other hand is outstretched and open, as if waiting for something.",
      "inActionDes": "You place the axe in the open hand of the suit of ^armor#. You hear something moving far upstairs.",
      "postActionDes": "The armor stand proudly, holding the missing axe that you returned.",
      "state": 0,
      "featureId": 0
    },

    {
      "name": "clock",
      "actionable": false,
      "usable": false,
      "preActionDes": "You look at the magnificent old clock. Somehow, it's still working.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 1

    }
  ],
      "roomId": 1,
      "directions": {"north":  5, "south": 20, "east": 0, "west": 2, "up": 11}
}