{
  "name": "Front Lawns",
  "longDes": "You are on the front lawns of the mansion. There is a large expanse of greenery before you. There are flower gardens near the front of the house, full of vibrant purple flowers. The borders of the flower gardens are of curious-looking stone. There are two rows of tall trees here. Under one tree you think that you can see a glow. To the North is the front porch of the house. To the South are the locked gates of the grounds. ",
  "shortDes": "You are standing on the front lawns. There are purples flower gardens here adjacent to the front of the house. Trees line the drive and you see locked gates beyond. To the North is the front porch leading to the house entry.",
  "visited": false,
  "startingItems": [
    {
      "name":"stone",
      "description":  "A stone with the image of a rose on it.",
      "linkedFeature": 0
    },
    {
      "name":"shears",
      "description":  "A pair of shears.",
      "linkedFeature": 1
  }
  ],
  "droppedItems": [],
  "features": [
    {
      "name": "garden",
      "actionable": true,
      "usable": false,
      "preActionDes": "You look at the purple flower garden. There is a stone that seems to be out of place on it.",
      "inActionDes": "You take the stone. Upon closer inspection, it's got a carved image of a rose on it.",
      "postActionDes": "This is where you took the stone with the rose on it.",
      "state": 0,
      "featureId": 0
    },

    {
      "name": "tree",
      "actionable": true,
      "usable": false,
      "preActionDes": "An apparition of a young girl appears by the tree. The young girl points at the tree and vanishes before your eyes!",
      "inActionDes": "Upon further inspection of the tree, you find a pair of shears.",
      "postActionDes": "This is where you found the set of shears.",
      "state": 0,
      "featureId": 1
    },

    {
      "name": "grave tree",
      "actionable": true,
      "usable": false,
      "preActionDes": "This tree looks like a significant part of the family's history. Perhaps it could be used?",
      "inActionDes": "You dig a hole at the bottom of the tree, making a makeshift grave. You place the girl's locket in and fill it with dirt. You use the carved stone as the grave's headstone.",
      "postActionDes": "You made a gravestone at this tree. It's got a carved stone for a headstone and the girl's locket in it.",
      "state": 0,
      "featureId": 2
    }
  ],
  "roomId": 21,
  "directions": {"north": 20}
}
