{
  "name": "Game Room",
  "longDes": "You have entered the Game Room, this looks like fun. In the center of the room is a dusty ^pool# table. To the West is a large picture ^window#. There is a ^painting# along one wall. A ^fireplace# stands on the east wall, and looks as if it hasn't been used in ages. There is a door with fogged glass to the $North#; You wonder where it leads. To the $South# is a door leading back to the library. To the $East# is a door that appears to lead to a small bathroom.",
  "shortDes": "You are in the mansion game room. A ^pool# table occupies the center of the room, and a ^fireplace# stands cold and dark. A ^window# to the west looks out to woods adjacent to the house. There is a door to the $North# that leads to the solarium. A small blue door to the $East# goes to a small bathroom. To the $South# is a door to the library.",
  "visited": false,
  "startingItems": [],
  "droppedItems": [],
  "features": [
    {
      "name": "fireplace",
      "actionable": true,
      "usable": true,
      "preActionDes": "This fireplace looks like it hasn't been used (or cleaned) in years.",
      "inActionDes": "You throw the ashes into the fire. The ashes instantly set a fire ablaze and a poltergeist appears!",
      "postActionDes": "The dimly lit fireplace is still glowing. You're not sure how the ashes caused the fireplace to start.",
      "state": 0,
      "featureId": 0
    },
    {
      "name": "pool",
      "actionable": true,
      "usable": false,
      "preActionDes": "This pool table looks fun. Perhaps you could play with the poltergeist?",
      "inActionDes": "You play a round of pool with the Poltergeist. He beat you after you scratched attempting to pocket the 8-ball.",
      "postActionDes": "You lost this game. Perhaps it's better to have kept the Poltergeist happy.",
      "state": 0,
      "featureId": 1
    },

    {
      "name": "painting",
      "actionable": false,
      "usable": false,
      "preActionDes": "You take a closer look at the painting. It's dogs playing poker!",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 2
    },

    {
      "name": "window",
      "actionable": false,
      "usable": false,
      "preActionDes": "You look out the window. All you can see is the beginning of a dense forest.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 3
    },

    {
      "name": "poltergeist",
      "actionable": true,
      "usable": false,
      "preActionDes": "The poltergeist hovers near the fireplace, looking at you curiously.",
      "inActionDes": "You shoot the poltergeist with the gun. Immediately the ghost changes color and flies into a rage.",
      "postActionDes": "",
      "state": 0,
      "featureId": 4
    }
  ],
  "roomId": 4,
  "directions": {"north": 3, "south": 2, "east": 5}
}
