{
  "name": "Green Room",
  "longDes": "You find yourself in the master’s bedroom. The walls are a deep green, and there are windows to the North and to the East. As you walk into the room your vision blurs and sound washes over you. You see the Chef, yelling something, waving an axe and chasing a woman and a man about the room. The Chef is swinging an axe. The woman and man are running, screaming. Your head swims, and the scene fades. You hear a crashing sound to the South. As you regain your senses you see a glint of light on the ceiling above the bed. There is a door to the Southwest that leads back to the second floor landing. A door to the Northwest leads to the pink room. ",
  "shortDes": "You are in the green room, which was the master’s quarters. There is a window to the north and another facing east. A door to the Southwest leads to the second floor landing. A door to the Northwest goes to the pink room.",
  "visited": false,
  "startingItems": [
    {
      "name":"axe",
      "description":  "A wooden axe.",
      "linkedFeature": 1
    }
  ],
  "droppedItems": [],
  "features": [
    {
      "name": "vision",
      "actionable": false,
      "usable": false,
      "preActionDes": "You witness a vision of a mad Chef swinging an axe in a rage while chasing his wife and the servant about the room. The scene washes away, and you hear a crash from the bathroom.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 0
    },

    {
      "name": "bed",
      "actionable": true,
      "usable": false,
      "preActionDes": "You follow the glint of light to the bed.",
      "inActionDes": "You see an axe sticking out from beneath the bed.",
      "postActionDes": "You found the axe under this bed.",
      "state": 0,
      "featureId": 1
    },

    {
      "name": "glint",
      "actionable": false,
      "usable": false,
      "preActionDes": "There is a glint on the ceiling. Tracing it, you notice something coming from the bed.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 2
    }
  ],
  "roomId": 12,
  "directions": {"northwest": 10, "southwest": 11}
}