{
  "name": "Kitchen",
  "longDes": "You enter what seems to be a kitchen. You can faintly smell the aroma of freshly-baked bread. There is a door to the $North# exiting onto gardens. A door to the $East# leads back to the dining room. Along the North wall, there is a large ^sink# with a ^window# above it. Stairs lead $down# into darkness. There is also a row of drawers along the Northern wall. One ^drawer# has a lock. Just as you finish a quick survey of the room, you notice something (or someone) move in the corner of your eye.\n\nYou turn and see a ghost of a ^chef#. He looks angry, but before you can react the apparition fades.",
  "shortDes": "You are in the Mansion's kitchen. The door to the North goes to the Rose Garden. The door to the East is the formal Dining Room. There are stairs leading down.  There is also a row of drawers along the Northern wall. One drawer has a lock.",
  "visited": false,
  "startingItems": [
    {
      "name":"knife",
      "description":  "The knife is a small pen knife. The handle has unusual swirling markings.",
      "linkedFeature": 1
  }
  ],
  "droppedItems": [],
  "features": [
    {
      "name": "chef",
      "actionable": false,
      "usable": false,
      "preActionDes": "The undead chef was just here. You got the impression that he didn't want you near. You are glad he is gone now.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 0
    },
    {
      "name": "drawer",
      "actionable": true,
      "usable": true,
      "preActionDes": "This drawer is locked. You can't open it, but there is a keyhole.",
      "inActionDes": "You unlock the drawer and notice, among other utensils, a @knife# with unusual markings on it.",
      "postActionDes": "This is where you found the knife.",
      "state": 0,
      "featureId": 1
    },
    {
      "name": "sink",
      "actionable": false,
      "usable": false,
      "preActionDes": "The sink is dirty and it stinks.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 2
    },
    {
      "name": "window",
      "actionable": false,
      "usable": false,
      "preActionDes": "You can see the garden and gazebo through the window.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 3
    }
  ],
  "roomId": 7,
  "directions": {"north": 19, "east": 6, "down": 14}
}
