{
    "name": "Parlor",
    "longDes": "You awaken…\nYour head swims and you hear laughter. As your vision clears, you find yourself sitting in a grand looking parlor. The walls are a rich dark wood. There is a ^couch# opposite and a ^fireplace# crackles along a wall to the east. Through a leaded glass ^window# to the south you can see large trees swaying in the breeze. You are seated in a large leather armchair. You feel very heavy and your head throbs. As you sit for what feels like a long time you regain your senses. You’re about to stand when you hear laughter again. It seems to be moving rapidly in circles above and then behind you. Suddenly the fire blows outward and extinguishes with a gust of cold air.  The air above the couch opposite seems to get hazy, a glow green-yellow, and then before you a figure sits. It’s hard to make out his features but he looks like he was once handsome. Now gaunt, he is clothed in a tattered suit and tails. You hear a voice, it seems to fade in and out, coming from within your own head.\n \n'...sorry about that, I felt you were near and I could not miss this chance.' '...too long. I hear them, all the time. My torment must stop.' '...took my loves away. He must be stopped.' '...you have four days. If you fail...' '...you will be here in my stead. Forever.' The ^poltergeist# looks at you for a moment, then seems to fade. When the figure is gone, you notice a small ^table# near the couch. To the $North# a doorway leads to a formal dining room. A door to the $West# leads to what appears to be a large foyer.",
    "shortDes": "You are in the parlor. The fire has died out in the ^fireplace# to the east and the ^poltergeist# cannot be seen any longer. You see a small ^table# near the ^couch# opposite. To the south, you see a ^window# facing out to the front lawns. To the $North# is a doorway to the formal dining room. To the $West# is the foyer.",
    "visited": false,
    "startingItems":[
        {
            "name":"pocketwatch",
            "description":  "A beautiful vintage pocketwatch.",
            "linkedFeature": 4
        }
    ],
    "droppedItems": [],
    "features":
    [
        {
            "name": "poltergeist",
            "actionable": false,
            "usable": false,
            "preActionDes":"The poltergeist spoke of a master killing his loved ones in this house. He is gone now.",
            "inActionDes": "",
            "postActionDes": "",
            "state": 0,
            "featureId": 0
        },
        {
            "name": "window",
            "actionable": false,
            "usable": false,
            "preActionDes":"You look out the window. You can see the porch and the front lawn.",
            "inActionDes": "",
            "postActionDes": "",
            "state": 0,
            "featureId": 1
        },
        {
            "name": "couch",
            "actionable": false,
            "usable": false,
            "preActionDes":"The couch is dusty and old. It looks like it may have once been expensive.",
            "inActionDes": "",
            "postActionDes": "",
            "state": 0,
            "featureId": 2
        },
        {
            "name": "fireplace",
            "actionable": false,
            "usable": false,
            "preActionDes":"The fireplace is surrounded by an intricately carved mantlepiece.",
            "inActionDes": "",
            "postActionDes": "",
            "state": 0,
            "featureId": 3
        },
        {
            "name": "table",
            "actionable": true,
            "usable": false,
            "preActionDes":"You see a small, delicate looking table. There is a @pocketwatch# on it.",
            "inActionDes": "You take the pocketwatch",
            "postActionDes": "This is where you found the pocketwatch.",
            "state": 0,
            "featureId": 4
        }
    ],
    "roomId": 0,
    "directions": {"north":  6, "west":  1}
  }
  