{
  "name": "Pink Room",
  "longDes": "You are in the pink room. The walls appear faded, almost dusty pink. There is a window to the North through which you can see the rose gardens, a fountain, and the gazebo. The floor is spattered a bit with paint. An ^easel# and small table stand beside the window. There is a ^loom# and some bins filled with cloth along the wall opposite the window. You feel a ringing in your ears as you stand here. A small and steep staircase leads $up# into the attic. A door to the $West# leads to the red room. Another door to the $East# leads to the green room.",
  "shortDes": "You are standing in the pink room, which serves as the art studio. You notice an ^easel# near a window facing north, overlooking the rose gardens.  A ^loom# occupies the room along the wall opposite. There is a door to the $West# leading to the red room, a door to the $East# leading to the green room, and a steep staircase heading $up#.",
  "visited": false,
  "startingItems": [
    {
    "name":"paintbrush",
    "description":  "The paintbrush is ready to use.",
    "linkedFeature": 0
    }
  ],
  "droppedItems": [],
  "features": [
    {
      "name": "easel",
      "actionable": false,
      "usable": false,
      "preActionDes": "This easel holds a blank canvas. There is a small table next to it, splattered with long-dry paint.",
      "inActionDes": "You begin to paint. Your hand moves as if independant of you.\n\nYou finish the painting. It's a dog. It's eyes look dead.\n\nYou begin to hear music playing from somewhere to the south, the area of the landing you think.",
      "postActionDes": "Your painting of the dog stands on the easel. Its eyes look hollow and dead.",
      "state": 0,
      "featureId": 0
    },

    {
      "name": "loom",
      "actionable": false,
      "usable": false,
      "preActionDes": "You look at the loom. It looks complex and you don't know where to begin with it. Best to leave it alone.",
      "inActionDes": "",
      "postActionDes": "",
      "state": 0,
      "featureId": 1
    }
  ],
  "roomId": 10,
  "directions": {"east":  12, "west":  9, "up": 13}
}